In [1]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split

In [2]:
#load dataset 
df = pd.read_csv("Python_Project_4_Log.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [3]:
#print all the column names 
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [4]:
#describe the data
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [5]:
#check the null value
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [6]:
# if there are Null values, Handle these
df = df.dropna()

In [7]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

# Working with Models

In [8]:
#Create the target data and feature data where target data is survived
X = df.drop(['Survived','Name','Ticket','PassengerId','Cabin'], axis=1)
y = df.Survived

In [9]:
X

     Pclass     Sex   Age  SibSp  Parch     Fare Embarked
1         1  female  38.0      1      0  71.2833        C
3         1  female  35.0      1      0  53.1000        S
6         1    male  54.0      0      0  51.8625        S
10        3  female   4.0      1      1  16.7000        S
11        1  female  58.0      0      0  26.5500        S
..      ...     ...   ...    ...    ...      ...      ...
871       1  female  47.0      1      1  52.5542        S
872       1    male  33.0      0      0   5.0000        S
879       1  female  56.0      0      1  83.1583        C
887       1  female  19.0      0      0  30.0000        S
889       1    male  26.0      0      0  30.0000        C

[183 rows x 7 columns]

# apply label-encoding on categorical data

In [10]:
from sklearn.preprocessing import LabelEncoder

In [11]:
enc=LabelEncoder()

In [12]:
X['Sex']=enc.fit_transform(X['Sex'])

In [13]:
X['Embarked']=enc.fit_transform(X['Embarked'])

In [14]:
X

     Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
1         1    0  38.0      1      0  71.2833         0
3         1    0  35.0      1      0  53.1000         2
6         1    1  54.0      0      0  51.8625         2
10        3    0   4.0      1      1  16.7000         2
11        1    0  58.0      0      0  26.5500         2
..      ...  ...   ...    ...    ...      ...       ...
871       1    0  47.0      1      1  52.5542         2
872       1    1  33.0      0      0   5.0000         2
879       1    0  56.0      0      1  83.1583         0
887       1    0  19.0      0      0  30.0000         2
889       1    1  26.0      0      0  30.0000         0

[183 rows x 7 columns]

In [19]:
#Split the data into training and testing set
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2, random_state = 42)

   # Create logistic regression model for target and feature data

In [21]:
from sklearn.linear_model import LogisticRegression

In [27]:
regg = LogisticRegression(solver='liblinear')
regg.fit(X_train,y_train)

LogisticRegression(solver='liblinear')

In [28]:
regg.score(X_test,y_test)

0.7567567567567568

In [29]:
regg.score(X_train,y_train)

0.7465753424657534

In [30]:
from sklearn.metrics import accuracy_score,precision_score,recall_score,confusion_matrix,f1_score

In [31]:
y_pred = regg.predict(X_test)

In [32]:
confusion_matrix(y_pred,y_test)

array([[ 8,  3],
       [ 6, 20]], dtype=int64)

In [34]:
accuracy_score(y_pred,y_test)

0.7567567567567568

In [35]:
precision_score(y_pred,y_test)

0.8695652173913043

In [36]:
recall_score(y_pred,y_test)

0.7692307692307693

In [37]:
f1_score(y_pred,y_test)

0.8163265306122449

END